{
  "Going-To-The-Sun Road": "Going-to-the-Sun Road is a highlight not to be missed during your Glacier visit. The Road spans 50 miles and crosses the Continental Divide at Logan Pass. During your traverse you will see impressive glaciers, beautiful valleys, cascading waterfalls, towering mountains and colorful wildflowers. Most visitors will also witness wildlife sightings on their trip across the Sun Road!",
  "Pacific Coast Highway": "The legendary Pacific Coast Highway (PCH) was first started in the 1930s, and remains a marvel of human effort that hugs over 900 kilometers (600 miles) of California’s rugged and beautiful coastlines. It is one of the most astoundingly scenic roads in the world, meant to be traversed slowly, while gasping at the mountains, towering trees, expansive beaches and endless sky. It also affords travelers an unparalleled opportunity to dip into all the character California has to offer: pioneer outposts, surfing villages, farm-fresh foods, local wine, roadside kitsch, Hollywood glitz and bohemia.",
  "Peak to Peak Highway": "Stretching 55 miles from Estes Park to I-70, the Peak to Peak Highway is about a 3 hour drive with stops along the way. Designated a Colorado Scenic Byway in 1918,  it begins as CO Highway 7 in Estes Park, passes Lily Mountain and Twin Sisters, then turns south just past Allenspark on CO Highway 72, goes to Nederland where it continues south on CO Highway 119, through Blackhawk, through Clear Creek Canyon and down to I-70.",
  "Guadalupe River Road": "This section of the Guadalupe is famous because of the exciting rapids, sparkling clear waters, scenic views, and good fishing. The river cuts through tall limestone bluffs and towering cypress trees. There are occasional rapids, but for the most part the river flows along lazily. Along the river you will find restaurants, bars with live music, plenty of outfitters, and a number of places to stay from tent camping to large houses to resorts with outstanding views of the river and the surrounding hills.",
  "Badlands": "The Black Hills of South Dakota is famous worldwide for the annual Sturgis Motorcycle Rally. Hundreds of thousands of visitors rumble into the region early each August for this larger-than-life gathering of motorcycle enthusiasts, celebrating its 82nd anniversary in 2022. Enjoy this biker-friendly town and the surrounding area that offers gorgeous rides for all skill levels.",
  "Tail of the Dragon": "Tail of the Dragon at Deals Gap with 318 curves in 11 miles: America's number one motorcycle and sports car road. Designated US 129, the road is bordered by the Great Smoky Mountains and the Cherokee National Forest with no intersecting roads or driveways to hamper your travel.",
  "Tunnel of Trees": "Michigan’s M-119, also known as the Tunnel of Trees, is one of Northern Michigan’s must-see attractions, perfect for a scenic drive or bike ride. A magical, scenic road that winds from Harbor Springs, (north of Petoskey) to Cross Village, the Tunnel of Trees has been ranked among the most scenic roads in Michigan and holds its own with the great natural beauties of the entire nation.",
  "default": "Come back later for more information about this ride. If you would like to leave a detailed description about your experience, please contact the site moderator."
}
